In [2]:
import numpy as np
import pandas as pd

1. ¿Qué diferencia hay entre una Serie y un DataFrame?

Una serie es una estructura de datos unidimensional similiar a un array o una columna de una tabla. 
El dataframe es bidimensional y está compuesto de series.

2. Crea dos listas:

Una que se llame "valores" que tenga 7 números aleatorios.
Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.
A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez.

Crea una Serie con el diccionario creado en el punto anterior.
¿Qué forma tiene esta última Serie?
¿Qué tipo de datos tiene?
¿Qué tamaño tiene?
¿Cuáles son los índices de la Serie?
¿Y los values?

Extrae el valor para el índice "lunes"
Extrae el valor para el índice "lunes", "martes" y "miércoles".
Extrae el valor para el índice "lunes" y "domingo".

3. Crea un array de dos dimensiones con 4 filas y 3 columnas.
Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [12]:
paises=np.empty((4, 3), dtype=object)
paises

array([[None, None, None],
       [None, None, None],
       [None, None, None],
       [None, None, None]], dtype=object)

In [11]:
df_paises=pd.DataFrame(paises, columns=["España", "Francia", "Italia"])
df_paises

  España Francia Italia
0   None    None   None
1   None    None   None
2   None    None   None
3   None    None   None

Descarga el archivo "medallas" y carga el DataFrame.

In [14]:
df_medallas=pd.read_csv("medallas.csv", index_col=0)
df_medallas.head()

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827
4           Irán   179    181     197
5     Kazajistán   155    158     224

Usando el loc extrae todas las columnas de la fila de Tailandia.

In [16]:
df_medallas.loc[7, :]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

Usando el loc extrae todas las columnas de China e Irán.

In [17]:
df_medallas.loc[(1,4), :]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [21]:
df_medallas.loc[(1,4), "Oro":"Bronce"]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

Usando el iloc extrae la información de la India. Devolved todas las columnas.

In [24]:
df_medallas.iloc[5, :]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object

Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [25]:
df_medallas.iloc[1::2, :]

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
4              Irán   179    181     197
6             India   154    202     315
8         Indonesia   112    131     240
10  Corea del Norte    91    120     235

Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [27]:
df_medallas.iloc[1::2, 1:4]

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235

¿Qué país consiguió más de 200 medallas de oro?

In [33]:
df_medallas.loc[df_medallas["Oro"]>200]

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [35]:
df_medallas.loc[(df_medallas["Oro"]>200)&(df_medallas["Plata"]>1000)]

    País   Oro  Plata  Bronce
2  Japón  1032   1037     985

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [36]:
df_medallas.loc[(df_medallas["Oro"]>200)|(df_medallas["Bronce"]>700)]

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [ ]:
df_medallas.insert(4, "Total", df_medallas["Oro"]+df_medallas["Plata"]+df_medallas["Bronce"])

In [39]:
df_medallas

               País   Oro  Plata  Bronce  Total
1             China  1473    994     720   3187
2             Japón  1032   1037     985   3054
3     Corea del Sur   745    663     827   2235
4              Irán   179    181     197    557
5        Kazajistán   155    158     224    537
6             India   154    202     315    671
7         Tailandia   132    175     278    585
8         Indonesia   112    131     240    483
9      China Taipéi    99    144     276    519
10  Corea del Norte    91    120     235    446